app/views/posts/index.html.erb

          <h5 class="card-title">
            <%= post.user.first_name %>, <%= time_ago_in_words(post.created_at) %> ago, <i class="text-muted"> <%= post.comments.count %> commentaires</i>.
            <% if post.user == current_user %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]


          <% post.comments[0,3].each do |comment| %>  <!-- affiche les 3 premiers commentaires uniquement -->
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]

              <div>
                <p class="text-muted"><%= comment.post.user.first_name %>, <%= time_ago_in_words(comment.created_at) %> ago.</p>
---
SELECT "posts".* FROM "posts"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

                  <button class="btn btn-success" id="add-comment-<%= post.id %>" onclick="displayForm(<%= post.id %>)">Laisser un avis</button>
                  <% if post.comments.count > 3 %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]