app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]
---
      <h5 class="card-title">
        <%= @post.user.first_name %>, <%= time_ago_in_words(@post.created_at) %> ago, <i class="text-muted"> <%= @post.comments.count %> commentaires</i>.
        <% if @post.user == current_user %>

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <div>
            <p class="text-muted"><%= comment.post.user.first_name %>, <%= time_ago_in_words(comment.created_at) %> ago.</p>