app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "updated_at", "post_id", "rating", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "Heeey cool ce post"], ["created_at", "2018-05-30 19:03:00.599096"], ["updated_at", "2018-05-30 19:03:00.599096"], ["post_id", 3], ["rating", 3], ["user_id", 1]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:comment][:post_id]
    @comment.user_id = params[:comment][:user_id]

    respond_to do |format|
      if @comment.save