app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Heeey, trop cool ma vie"], ["created_at", "2018-05-30 18:59:49.739321"], ["updated_at", "2018-05-30 18:59:49.739321"], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save